export function aboutProgram() {
	alert( 'С помощью данной программы можно построить окружность или эллипс следующими способамии:\n'+
	'1) Библеотечный способ\n'+
	'2) Каноническое уравнненние;\n'+
	'3) Параметрическое уравнение;\n'+
	'4) Алгоритм Брезенхема;\n'+
	'5) Алгоритм средней точки;\n'+
	'\nДля построения фигуры необходимо задать предложенные параметры, '+
	'выбрать метод построения из списка предложенных.\n'+
	'\nДля построения спектра фигур '+
	'необходимо задать центр фигуры, радиус(ы) '+
	'выбрать метод для построения, '+
	'а так же шаг изменения и количество фигур.\n'+
	'\nДля анализа времени работы нажмите кннопку статистика.\n'
	)
}

export function aboutAthor() {
	alert("Программа разработана: Земцов Артемий Иу7-44Б")
}
